protected/components/TController.php

SELECT COUNT(*) FROM `tbl_user`
---
    public function beforeAction($action)
    {
        // Validate domain name
        if (isset(\Yii::$app->params['domain']) && ! $this->checkDomain()) {
            return false;
        }

        if (! file_exists(DB_CONFIG_FILE_PATH)) {
            if ($this->module->id != 'installer') {
                $this->redirect([
                    "/installer"
                ]);
                return false;
            }
        }
        if (User::find()->count() == 0 && \Yii::$app->controller->id != 'user' && $action != 'add-admin') {