themes/base/views/layouts/guest-main.php

	</header>
	<!-- Frntre Nav -->
	<?php
	$categoryModel = Category::find()->where(['state_id' => Category::STATE_ACTIVE])->limit(10)->all();
---
SELECT * FROM `tbl_category` WHERE `state_id`=1 LIMIT 10