protected/controllers/OrderController.php

    protected function findModel($id, $accessCheck = true)

    {


        if (($model = Order::findOne($id)) !== null) {
---
SELECT * FROM `tbl_order` WHERE `id`='1'