protected/controllers/UserController.php

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `tbl_user` WHERE `id`='1'