protected/views/site/index.php

SELECT * FROM `tbl_category` WHERE `state_id`=1
---
	</div>
</section>
<?php
$categoryModel = ModelsCategory::find()->where(['state_id' => Category::STATE_ACTIVE])->all();