protected/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne([
            'id' => $id,
            'state_id' => [
                self::STATE_ACTIVE
            ]
        ]);
---
SELECT * FROM `tbl_user` WHERE (`id`=1) AND (`state_id`=1)